ЕРПУХАстенд.cbr_Основной/src/Documents/ПеремещениеТоваров/ПеремещениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="050b09a5-e36c-42b6-b337-cdddd2968bea">
  <name>ПеремещениеТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.cbr_ТоварыКПеремещению</registerRecords>
  <tabularSections extendedConfigurationObject="ec1f4519-6787-456f-8137-6e0249afc4c8">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>cbr_ЗаказПоставщику</name>
      <comment>//++АшаеваАН 13.02.26 СКЛ.3</comment>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
      </type>
    </attributes>
    <attributes>
      <name>cbr_ПТУ</name>
      <comment>//++АшаеваАН 13.02.26 СКЛ.3</comment>
      <type>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЕРПУХАстенд.cbr_Основной/src/Documents/ПеремещениеТоваров/ManagerModule.bsl
#Область ОбработчикиСобытий
&ИзменениеИКонтроль("ДанныеТаблицыТоварыДокумента")
Функция cbr_ДанныеТаблицыТоварыДокумента(Накладная) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.НомерСтроки                    КАК НомерСтроки,
	|	Таблица.Номенклатура                   КАК Номенклатура,
	|	Таблица.Характеристика                 КАК Характеристика,
	|	Таблица.НоменклатураНабора             КАК НоменклатураНабора,
	|	Таблица.ХарактеристикаНабора           КАК ХарактеристикаНабора,
	|	Таблица.Упаковка                       КАК Упаковка,
	|	Таблица.КоличествоУпаковок             КАК КоличествоУпаковок,
	|	Таблица.Количество                     КАК Количество,
	|	Таблица.КодСтроки                      КАК КодСтроки,
	|	Таблица.СтатусУказанияСерий            КАК СтатусУказанияСерий,
	|	Таблица.СтатусУказанияСерийОтправитель КАК СтатусУказанияСерийОтправитель,
	|	Таблица.СтатусУказанияСерийПолучатель  КАК СтатусУказанияСерийПолучатель,
	|	ВЫБОР КОГДА Таблица.Ссылка.ПеремещениеПоЗаказам
	|		ТОГДА Таблица.ЗаказНаПеремещение
	|		ИНАЧЕ Таблица.Ссылка
	|	КОНЕЦ                                  КАК ЗаказНаПеремещение,
	|	Таблица.Сделка                         КАК Сделка,
	|	Таблица.Назначение                     КАК Назначение,
	|	Таблица.НазначениеОтправителя          КАК НазначениеОтправителя,
	|	Таблица.Серия                          КАК Серия,
	|	Таблица.АналитикаУчетаНоменклатуры     КАК АналитикаУчетаНоменклатуры,
	#Вставка
	//++АшаеваАН 13.02.26 СКЛ.3
	|	Таблица.cbr_ЗаказПоставщику КАК cbr_ЗаказПоставщику,
	|	Таблица.cbr_ПТУ КАК cbr_ПТУ,
	//--АшаеваАН 13.02.26 СКЛ.3
	#КонецВставки
	|	Таблица.ИдентификаторСтроки            КАК ИдентификаторСтроки
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Накладная";

	Запрос.УстановитьПараметр("Накладная", Накладная);

	Результат = Запрос.Выполнить().Выгрузить();

	Возврат Результат;

КонецФункции
#КонецОбласти
